:PROPERTIES:
:ID:       1b0646eb-ed64-4b37-a394-4974750aaf7a
:END:
#+title: 类型转换
#+filetags: cpp

*** std::reinterpret_cast
:PROPERTIES:
:ID:       fd1b6149-4506-4bf9-abd0-279fa6792490
:END:
- std::reinterpret_cast :: （重解释转换）逐bit的将一种类型转换为另一种类型，无检查，风险极高，用于 *指针之间/引用间转换* 或 *指针/引用与整数间的转换*
#+begin_src cpp :results output :namespaces std :includes <iostream> <cstdint>
int a = 42;
uintptr_t addr = reinterpret_cast<uintptr_t>(&a); // 指针转为整数
int* p = reinterpret_cast<int*>(addr);            // 整数转为指针
cout << *p << "\n";
#+end_src

#+RESULTS:
: 42


* Footnotes

[fn:1]
#+name: 如果没有隐式类型转换...
#+begin_src cpp :results output :namespaces std :includes <iostream> <cstring>
int main() {
  int n { 3 };
  float f {};
  memcpy(&f, &n, sizeof(float)); // 无隐式转换：逐字节将 n 拷贝到 f，由于编译器对数据类型的解释，会打印出奇怪的值
  cout << f << endl;

  f = n;                         // 有隐式转换：打印出期望的值
  cout << f << endl;
}
#+end_src

#+RESULTS: 如果没有隐式类型转换...
: 4.2039e-45
: 3

[fn:2]
CPU处理数据更高效（eg：32位CPU 处理 int（32位）相比 char（8位）更快）

[fn:3]
#+begin_src cpp :results output :namespaces std :includes <iostream>
int x = 10, y = 4;
double d = x / y;               // 结果为2.0，因为 先进行 x / y 得到 int 2，然后转为 double 2.0
cout << d << '\n';

/* 强制类型转换 */
d = static_cast<double>(x) / y; // 结果为2.5，因为 x 转为 double 10.0，根据 算数转换，y 转为 double 4.0
cout << d << '\n';
#+end_src

#+RESULTS:
: 2
: 2.5

[fn:4]
#+name: 基本类型转换
#+begin_src cpp :results output :namespaces std :includes <iostream>
double d = 3.14;
int i = static_cast<int>(d);
cout << i << '\n';
#+end_src

#+RESULTS: 基本类型转换
: 3

[fn:5]
#+name: 向下转型
#+begin_src cpp :results output :namespaces std :includes <iostream>
/* 有虚函数的继承体系 */
struct Base {
    virtual ~Base() {} // 有虚函数
};
struct Derived : Base {};

Base* b = new Derived;
Derived* d = dynamic_cast<Derived*>(b); // ok
if (b) {
  cout << "转换成功" << '\n';
} else {
  cout << "转换失败" << '\n';
}

/* 没有虚函数的继承体系 */
struct NonPolyBase {}; // 没有虚函数
struct NonPolyDerived : NonPolyBase {};
NonPolyBase* npb = new NonPolyDerived;
// NonPolyDerived* npd = dynamic_cast<NonPolyDerived*>(npb); // FIXME 不是有虚函数的继承体系，无法使用 std::dynamic_cast
#+end_src

#+RESULTS: 向下转型
: 转换成功

#+name: 转换失败返回空指针
#+begin_src cpp :results output :namespaces std :includes <iostream>
class Base { virtual void f() {} };
class Derived : public Base {};

int main() {
  Base* b = new Base();                   // 指向基类对象
  Derived* d = dynamic_cast<Derived*>(b); // 转换失败，d为nullptr
  if (d) {
    cout << "转换成功" << '\n';
  } else {
    cout << "转换失败" << '\n';
  }
  delete b;
}
#+end_src
